# Dispose Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FluidTemperatureSetIterator..::..Dispose Method
FluidTemperatureSetIterator Class See Also
---
Releases all resources used by the FluidTemperatureSetIterator
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# See Also
FluidTemperatureSetIterator Class
Autodesk.Revit.DB.Plumbing Namespace